import 'package:oman_trippoint/widgets/SafeScreen.dart';
import 'package:oman_trippoint/widgets/appBarWidget.dart';
import "package:flutter/material.dart";
import "package:easy_localization/easy_localization.dart";

class TermsAndConditionsScreen extends StatelessWidget {
  static String router = "/terms_conditions";
  const TermsAndConditionsScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeScreen(
        padding: 0,
        child: Column(children: [
          AppBarWidget(title: "Terms And Conditions".tr()),
          Expanded(
              child: ListView(
                  keyboardDismissBehavior:
                      ScrollViewKeyboardDismissBehavior.onDrag,
                  children: const [
                SizedBox(
                  height: 30,
                ),
                Padding(
                  padding: EdgeInsets.all(10),
                  child: Text("""
اتباع وقراء هذه الصفحة مهم جدا.
أولا هذه المنصة (تطبيق) ليست شركة وتسهم في تطوير جزء من الاعلان للأنشطة السياحية, وهي تعمل كوسيط بين المستخدم و صاحب النشاط السياحي. 

الشروط التي سيتم ذكرها باللغة العربية فقط وقد تخضع للتحديث في أي وقت ونحن غير مسؤولين عن عدم الاطلاع عليها او اي سوء فهم.

إنشاء حساب احترافي:
إنشاء حساب احترافي لتستطيع منه الإعلان عن أنشطتك السياحية اذهب للملف الشخصي > التحويل لحساب احترافي, ثم قم بإدخال المعلومات بشكل صحيحة وسيتم مراجعة طلبك في اقل من يوم والتواصل معك إذا لزم. عدم إدخال المعلومات بشكل صحيح يؤدي إلى حذف الحساب. وشروط التحويل إلى حساب احترافي هي: 
- يجب ان تكون اكبر من 18 سنة 
- يجب ان يكون لديك رقم هاتف 
- يجب ادخال الاسم بشكل صحيح

نشر اعلان نشاط سياحي:
عند تعبئة القائمة لإنشاء النشاط السياحي (إضافة نشاط) يجب ملئ المعلومات بشكل صحيح ويمكنك تعديلها لاحقا اذا رغبت في ذلك, و يجود في المنصة نظام للبلاغات و نقوم بمراجعته بشكل دوري لضمان صحة البيانات و أبعاد التزييف في هذه المنصة. و سيتحمل ناشر النشاط أي تبعات نشر معلومات خاطئة لاستهداف أو استغلال أو اضلال المستخدمين بأي طريقة كانت و تخلي المنصة مسؤوليتها للاعلانات المزيفة و سيتم إخضاع المخالفين للمحاكمة القانونية و المنصة تملك معلومات كفيلة بتحديد هوية المستخدمين . شروط نشر اعلان نشاط سياحي هي: 
- ادخال صور صحيحة للنشاط السياحي .
- إضافة عنوان .
- وصف قصير عن النشاط. 
- ادخال موقع النشاط  السياحي. 
- إدخال أسعار للنشاط السياحي.


إيقاف المستخدمين أو الإعلانات:
المعلومات المدخلة في هذه المنصة يجب أن تكون صحيحة و لدينا الحق في ايقاف حسابك أو إعلاناتك إذا تم مخافة الآتي:
- محاولة تزييف الاعلان باي شكل كان من ادراج صور خاطئه او حسابات او ارقام خاطئة.
- إدخال معلومات خاطئة في الحساب إذا كنت معلن.
- محاولة اختراق المنصة أو اعطالها سيستوجب منعه من دخول المنصة والإخضاع للمحاكمة القانونية.
- لأي محاولة للإضرار المستخدمين بأي شكل كان.



"""),
                )
              ]))
        ]));
  }
}
